# Databases

![Data Science Workflow](img/ds-workflow.png)

## Acquire Data
### Common Data Sources
- The Internet - Web Scraping
- **Databases**
- CSV
- Excel
- Parquet

### Database
- **Relational databases** models data in rows and columns in a series of tables.
- Like a collection of **DataFrames/Excel sheets**.
- **SQL** (often pronounced *sequel*): Structured Query Language
- Non-relational databases [NoSQL](https://en.wikipedia.org/wiki/NoSQL)

### SQLite database
- [SQLite database](https://www.sqlite.org/index.html) software library that provides a relational database management system
- Lightweight to setup, administrate, and requires low resources.

### Dataset (in a SQLite database)
- Dallas Police Officer-Involved Shootings
- Has three tables: **incidents, officers, subjects**

#### Other SQLite datasets
- [SQLite Data Starter Packs](http://2016.padjo.org/tutorials/sqlite-data-starterpacks/)
- [Iris Species (Kaggle)](https://www.kaggle.com/uciml/iris)
- [European Soccer Database (Kaggle)](https://www.kaggle.com/hugomathien/soccer)

### Database connector
- The [sqlite3](https://docs.python.org/3/library/sqlite3.html) is an interface for SQLite databases.
- No installation needed.

#### Other database connectors for Python
* [MySQL Connector](https://dev.mysql.com/doc/connector-python/en/) for MySQL
* [Psycopg](http://initd.org/psycopg/docs/install.html) for PostgreSQL
* [pymssql](http://pymssql.org/en/stable/) for Microsoft MS SQL

To import and connect to a SQLite database.
```Python
import sqlite3
conn = sqlite3.connect('files/dallas-ois.sqlite')
```

In [1]:
import sqlite3

In [28]:
conn = sqlite3.connect('files/dallas-ois.sqlite')

The interface to the datases is through the `cursor`.

```Python
cursor = conn.cursor()
```

The `execute` method allows to run `SQL` queries on our database.

To get a list of all the tables the following query can be applied.

```SQL
SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
```

The result is fetched with the `fetchall()` method.

In [3]:
cursor = conn.cursor()

In [6]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name")

In [7]:
cursor.fetchall()

[('incidents',), ('officers',), ('subjects',)]

To get a description of a table

```SQL
PRAGMA table_info(officers)
```

In [29]:
cursor.execute("PRAGMA table_info(officers)").fetchall()

[(0, 'case_number', 'TEXT', 0, None, 0),
 (1, 'race', 'TEXT', 0, None, 0),
 (2, 'gender', 'TEXT', 0, None, 0),
 (3, 'last_name', 'TEXT', 0, None, 0),
 (4, 'first_name', 'TEXT', 0, None, 0),
 (5, 'full_name', 'TEXT', 0, None, 0)]

### SQL syntax
Get all data from table
```SQL
SELECT * FROM table_name
```

Limit the response
```SQL
SELECT * FROM table_name LIMIT 100
```

Filter data
```SQL
SELECT * FROM table_name WHERE column_name > 1
```

### Import data into DataFrame
Example of how to read data into a DataFrame from a SQL statement
```Python
import pandas as pd

officers = pd.read_sql('SELECT * FROM officers', conn)
```

In [10]:
import pandas as pd

In [53]:
officers = pd.read_sql('SELECT * FROM officers', conn)
officers.shape

(370, 6)

In [56]:
len(officers['full_name'].unique())

344

### SQL join syntax
`(INNER) JOIN`: returns records that have matching values in both tables
```SQL
SELECT * FROM table_1 JOIN table_2 ON table_1.column_name_1=table_2.column_name_2
```

`LEFT JOIN`: returns all records from the left table, and the matched records from the right table
```SQL
SELECT * FROM table_1 JOIN table_2 ON table_1.column_name_1=table_2.column_name_2
```

In [52]:
officers = pd.read_sql('SELECT * FROM officers JOIN incidents ON officers.case_number=incidents.case_number', conn)
officers.shape

(370, 21)

In [39]:
(officers.groupby('gender').count())

        case_number  race  last_name  first_name  full_name
gender
F                19    18         19          18         19
M               351   348        351         349        351

In [44]:
incidents = pd.read_sql('SELECT * FROM incidents', conn)
incidents.shape

(219, 15)

In [20]:
subjects = pd.read_sql('SELECT * FROM subjects', conn)
subjects.head()

  case_number race gender last_name first_name        full_name
0      44523A    L      M     Curry      James     Curry, James
1     121982X    L      M    Chavez    Gabriel  Chavez, Gabriel
2     605484T    L      M   Salinas       Nick    Salinas, Nick
3     384832T    B      M     Smith      James     Smith, James
4     384832T    B      M      Dews    Antonio    Dews, Antonio